# FMarkerByClass

## Description
Function FMarkerByClass returns whether the global attributes are set to use the arrow style of the default class.

```pascal
FUNCTION FMarkerByClass : BOOLEAN;
```

```python
def vs.FMarkerByClass():
    return BOOLEAN
```

## Remarks
Returns whether the global attributes are set to use the arrow style of the default class.
[sd 8/19/98]

## Examples
==== VectorScript ====
```pascal
useClassMarker:=FMarkerByClass;
```
==== Python ====
```python
useClassMarker = vs.FMarkerByClass()
```

## Version
Availability: from VectorWorks8.0

## Category
* Document Attributes